Tekla Open API Reference for Tekla Structures 2025
Dialogs.LoadAttributeFileNameToDialogAndModify Method
Overload List
Name | Description
LoadAttributeFileNameToDialogAndModify(String)
 Uses the attributes found from the attribute file as the current values for the specified dialog. Modifies the current selected instance. Applied values for this dialog are not changed.
LoadAttributeFileNameToDialogAndModify(String, String)
 Loads the specified dialog's current values from the attribute file and modifies the current selected instance.
Top
See Also
Reference
Dialogs Class
Tekla.Structures.Dialog Namespace